ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/SVD/HC32F448JAUI.svd
                <register>
                    <name>SNSEQCTLB4</name>
                    <description>desc SNSEQCTLB4</description>
                    <alternateRegister>SNSEQCTL4</alternateRegister>
                    <addressOffset>0x150</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SNSDIST</name>
                            <description>desc SNSDIST</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSCNTB</name>
                            <description>desc SNSCNTB</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DNSEQCTL4</name>
                    <description>desc DNSEQCTL4</description>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DOFFSET</name>
                            <description>desc DOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSCNT</name>
                            <description>desc DNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DNSEQCTLB4</name>
                    <description>desc DNSEQCTLB4</description>
                    <alternateRegister>DNSEQCTL4</alternateRegister>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DNSDIST</name>
                            <description>desc DNSDIST</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSCNTB</name>
                            <description>desc DNSCNTB</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LLP4</name>
                    <description>desc LLP4</description>
                    <addressOffset>0x158</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFC</resetMask>
                    <fields>
                        <field>
                            <name>LLP</name>
                            <description>desc LLP</description>
                            <msb>31</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTL4</name>
                    <description>desc CHCTL4</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SINC</name>
                            <description>desc SINC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DINC</name>
                            <description>desc DINC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRPTEN</name>
                            <description>desc SRPTEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPTEN</name>
                            <description>desc DRPTEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSEQEN</name>
                            <description>desc SNSEQEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSEQEN</name>
                            <description>desc DNSEQEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSIZE</name>
                            <description>desc HSIZE</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPEN</name>
                            <description>desc LLPEN</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPRUN</name>
                            <description>desc LLPRUN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPROT</name>
                            <description>desc HPROT</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSAR4</name>
                    <description>desc MONSAR4</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDAR4</name>
                    <description>desc MONDAR4</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDTCTL4</name>
                    <description>desc MONDTCTL4</description>
                    <addressOffset>0x168</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONRPT4</name>
                    <description>desc MONRPT4</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPT</name>
                            <description>desc SRPT</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DRPT</name>
                            <description>desc DRPT</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSNSEQCTL4</name>
                    <description>desc MONSNSEQCTL4</description>
                    <addressOffset>0x170</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFFSET</name>
                            <description>desc SOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SNSCNT</name>
                            <description>desc SNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONDNSEQCTL4</name>
                    <description>desc MONDNSEQCTL4</description>
                    <addressOffset>0x174</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DOFFSET</name>
                            <description>desc DOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DNSCNT</name>
                            <description>desc DNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SAR5</name>
                    <description>desc SAR5</description>
                    <addressOffset>0x180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DAR5</name>
                    <description>desc DAR5</description>
                    <addressOffset>0x184</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DTCTL5</name>
                    <description>desc DTCTL5</description>
                    <addressOffset>0x188</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RPT5</name>
                    <description>desc RPT5</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPT</name>
                            <description>desc SRPT</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPT</name>
                            <description>desc DRPT</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RPTB5</name>
                    <description>desc RPTB5</description>
                    <alternateRegister>RPT5</alternateRegister>
                    <addressOffset>0x18C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPTB</name>
                            <description>desc SRPTB</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPTB</name>
                            <description>desc DRPTB</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNSEQCTL5</name>
                    <description>desc SNSEQCTL5</description>
                    <addressOffset>0x190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFFSET</name>
                            <description>desc SOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSCNT</name>
                            <description>desc SNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNSEQCTLB5</name>
                    <description>desc SNSEQCTLB5</description>
                    <alternateRegister>SNSEQCTL5</alternateRegister>
                    <addressOffset>0x190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SNSDIST</name>
                            <description>desc SNSDIST</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSCNTB</name>
                            <description>desc SNSCNTB</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DNSEQCTL5</name>
                    <description>desc DNSEQCTL5</description>
                    <addressOffset>0x194</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DOFFSET</name>
                            <description>desc DOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSCNT</name>
                            <description>desc DNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DNSEQCTLB5</name>
                    <description>desc DNSEQCTLB5</description>
                    <alternateRegister>DNSEQCTL5</alternateRegister>
                    <addressOffset>0x194</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DNSDIST</name>
                            <description>desc DNSDIST</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSCNTB</name>
                            <description>desc DNSCNTB</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LLP5</name>
                    <description>desc LLP5</description>
                    <addressOffset>0x198</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFC</resetMask>
                    <fields>
                        <field>
                            <name>LLP</name>
                            <description>desc LLP</description>
                            <msb>31</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
