ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/SVD/HC32F448JAUI.svd
                <register>
                    <name>XIDFC</name>
                    <description>desc XIDFC</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFC</resetMask>
                    <fields>
                        <field>
                            <name>FLESA</name>
                            <description>desc FLESA</description>
                            <msb>15</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSE</name>
                            <description>desc LSE</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XIDAM</name>
                    <description>desc XIDAM</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FFFFFFF</resetValue>
                    <resetMask>0x1FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EIDM</name>
                            <description>desc EIDM</description>
                            <msb>28</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPMS</name>
                    <description>desc HPMS</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BIDX</name>
                            <description>desc BIDX</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSI</name>
                            <description>desc MSI</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIDX</name>
                            <description>desc FIDX</description>
                            <msb>14</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLST</name>
                            <description>desc FLST</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDAT1</name>
                    <description>desc NDAT1</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ND0</name>
                            <description>desc ND0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND1</name>
                            <description>desc ND1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND2</name>
                            <description>desc ND2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND3</name>
                            <description>desc ND3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND4</name>
                            <description>desc ND4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND5</name>
                            <description>desc ND5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND6</name>
                            <description>desc ND6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND7</name>
                            <description>desc ND7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND8</name>
                            <description>desc ND8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND9</name>
                            <description>desc ND9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND10</name>
                            <description>desc ND10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND11</name>
                            <description>desc ND11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND12</name>
                            <description>desc ND12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND13</name>
                            <description>desc ND13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND14</name>
                            <description>desc ND14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND15</name>
                            <description>desc ND15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND16</name>
                            <description>desc ND16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND17</name>
                            <description>desc ND17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND18</name>
                            <description>desc ND18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND19</name>
                            <description>desc ND19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND20</name>
                            <description>desc ND20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND21</name>
                            <description>desc ND21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND22</name>
                            <description>desc ND22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND23</name>
                            <description>desc ND23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND24</name>
                            <description>desc ND24</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND25</name>
                            <description>desc ND25</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND26</name>
                            <description>desc ND26</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND27</name>
                            <description>desc ND27</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND28</name>
                            <description>desc ND28</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND29</name>
                            <description>desc ND29</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND30</name>
                            <description>desc ND30</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ND31</name>
                            <description>desc ND31</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
